baseline/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(

    {

        name wing;

        patchInfo
        {
            type wall;
        }

        constructFrom patches;
        patches (auto0 auto1 auto2 auto3 auto4);
        
    }

    {

        name sym1;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;
        patches (auto35);

    }

    {

        name sym2;

        patchInfo
        {
            type symmetry;
        }

        constructFrom patches;
        patches (auto36);

    }

    {

        name inout;

        patchInfo
        {
            type patch;
        }

        constructFrom patches;
        patches (auto5 auto6 auto7 auto8 auto9 auto10 auto11 auto12 auto13 auto14 auto15 auto16 auto17 auto18 auto19 auto20 auto21 auto22 auto23 auto24 auto25 auto26 auto27 auto28 auto29 auto30 auto31 auto32 auto33 auto34);

    }
    
);

// ************************************************************************* //
