baseline/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          392;
        startFace       20433;
    }
    sym1
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          11672;
        startFace       20825;
    }
    sym2
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          11672;
        startFace       32497;
    }
    inout
    {
        type            patch;
        nFaces          30;
        startFace       44169;
    }
)

// ************************************************************************* //
